max-bot-cf/InformationRegisters/энргДолжностиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДолжностиСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИОСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/энргДолжностиСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает должности сотрудников.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Сотрудник	-	СправочникСсылка.энргСотрудники.
//  МВТ			-	МенеджерВременныхТаблиц.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьДолжностиСотрудников(Период,Организация,Сотрудник = Неопределено,МВТ = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДолжностиСотрудниковСрезПоследних.Организация КАК Организация,
	|	энргДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(энргДолжностиСотрудниковСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ДолжностиСрез
	|ИЗ
	|	РегистрСведений.энргДолжностиСотрудников.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК энргДолжностиСотрудниковСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Подписанты КАК Подписанты
	|		ПО энргДолжностиСотрудниковСрезПоследних.Сотрудник = Подписанты.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	энргДолжностиСотрудниковСрезПоследних.Организация,
	|	энргДолжностиСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргДолжностиСотрудников.Организация КАК Организация,
	|	энргДолжностиСотрудников.Должность КАК Должность,
	|	энргДолжностиСотрудников.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ДолжностиСотрудников
	|ИЗ
	|	ДолжностиСрез КАК ДолжностиСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДолжностиСотрудников КАК энргДолжностиСотрудников
	|		ПО ДолжностиСрез.Организация = энргДолжностиСотрудников.Организация
	|			И ДолжностиСрез.Сотрудник = энргДолжностиСотрудников.Сотрудник
	|			И ДолжностиСрез.Период = энргДолжностиСотрудников.Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудник = &Сотрудник", "Истина");
	КонецЕсли;
	
	Если МВТ = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ ДолжностиСотрудников", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВНУТРЕННЕЕ СОЕДИНЕНИЕ Подписанты КАК Подписанты", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО энргДолжностиСотрудниковСрезПоследних.Сотрудник = Подписанты.Сотрудник", "");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.Должность;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Возврат Запрос.Выполнить();
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
